[
  {
    "date": "SEPT. 2024 - PRESENT",
    "title": "Developer Co-Op",
    "organization": "RBC",
    "description": "Contributed to the development of an internal application powered by machine learning using TypeScript, Vue.js, and Pinia. In collaboration with a cross-functional team consisting of designers, developers, and product managers, I worked on delivering eight new full features that improved user interfaces and functionality. Operating in an agile environment, we ensured the application adhered to high standards of web accessibility and quality, allowing for smooth user experiences.",
    "skills": [
      "Axios",
      "Express.js",
      "HTML",
      "Node.js",
      "Pinia",
      "SCSS",
      "TypeScript",
      "Vue"
    ]
  },
  {
    "date": "SEP. 2024 - OCT. 2024",
    "title": "Portfolio",
    "description": "Developed a personal portfolio to showcase my software development skills. The portfolio highlights interactive animations using TypeScript, Vue.js, and Vanta.js, and features advanced JavaScript animation libraries like TypeIt to create engaging user experiences. Through this project, I demonstrated my ability to build visually dynamic, responsive web applications that emphasize both technical precision and creative design.",
    "code": "https://github.com/CHamilton02/Portfolio",
    "skills": [
      "Axios",
      "HTML",
      "SCSS",
      "Pinia",
      "Typeit",
      "TypeScript",
      "Vue",
      "Vanta"
    ]
  },
  {
    "date": "JUL. 2024",
    "title": "SportIQs",
    "description": "Created SportIQs, a sports trivia game that leverages React to deliver interactive quizzes across various sports categories. Using Vite for fast and efficient builds, I ensured quick development cycles and seamless deployment on GitHub Pages. The project also featured state management techniques, which helped maintain smooth interactions and provided an engaging, responsive experience for users on various devices.",
    "skills": ["CSS", "HTML", "JavaScript", "React", "Vite"],
    "website": "https://chamilton02.github.io/SportIQs/",
    "code": "https://github.com/CHamilton02/SportIQs"
  },
  {
    "date": "MAY 2024 - JUN. 2024",
    "title": "Djibouti",
    "description": "Built an interactive web-based game inspired by Wordle, where users guess country names. Leveraged JavaScript classes to manage data and user interactions. Utilized Jasmine for unit and integration testing, ensuring the game’s functionality worked as intended and provided an engaging experience.",
    "skills": ["CSS", "HTML", "JavaScript", "Jasmine"],
    "website": "https://chamilton02.github.io/Djibouti/",
    "code": "https://github.com/CHamilton02/Djibouti"
  },
  {
    "date": "MAY 2024",
    "title": "Password Manager",
    "description": "Engineered a secure password manager application using Python, implementing encryption techniques such as password-based key derivation and the Fernet encryption scheme to ensure data protection. I designed the user interface using Tkinter, providing a simple yet effective solution for managing and generating passwords, with a focus on balancing ease of use and security.",
    "skills": ["Base64.py", "Cryptography.py", "Python", "Tkinter.py"],
    "code": "https://github.com/CHamilton02/Password-Manager"
  },
  {
    "date": "MAR. 2024 - MAY 2024",
    "title": "Front-End Developer",
    "organization": "Stone Row Farm Inc.",
    "description": "Developed business web pages using HTML, CSS, Bootstrap, and JavaScript. Collaborating with the business owners, I iterated on design feedback and proposed solutions to meet their evolving needs.",
    "skills": ["Bootstrap", "CSS", "HTML", "JavaScript"]
  }
]
